In [2]:
# Working with Pandas dataframes
import pandas as pd

In [3]:
import numpy as np

In [4]:
li = [[100, "ryan", 100000.5],
      [101, "Mike", 20000.5],
      [102, 'Jonny', 25000.6]]
arr2d = np.array(li)

In [5]:
arr2d

array([['100', 'ryan', '100000.5'],
       ['101', 'Mike', '20000.5'],
       ['102', 'Jonny', '25000.6']], dtype='<U32')

In [6]:
print(arr2d[:,0])

['100' '101' '102']

In [6]:
print(arr2d[:,1])

['ryan' 'Mike' 'Jonny']

In [7]:
print(arr2d[:,2])

['100000.5' '20000.5' '25000.6']

In [7]:
#  Now lets convert this list to a data frame instead of an array
df = pd.DataFrame(li)

In [8]:
df

     0      1         2
0  100   ryan  100000.5
1  101   Mike   20000.5
2  102  Jonny   25000.6

In [14]:
# change the column names
df = pd.DataFrame(li, columns=['emp_no', 'name', 'salary'])

In [13]:
df

   emp_no   name    salary
0     100   ryan  100000.5
1     101   Mike   20000.5
2     102  Jonny   25000.6

In [10]:
# change the row names
df = pd.DataFrame(li, index=['row1', 'row2', 'row3'])

In [12]:
df

        0      1         2
row1  100   ryan  100000.5
row2  101   Mike   20000.5
row3  102  Jonny   25000.6

In [15]:
# Slice a specific column from the dataframe
df.emp_no

0    100
1    101
2    102
Name: emp_no, dtype: int64

In [16]:
# or alternatively, do it this way
df['emp_no']

0    100
1    101
2    102
Name: emp_no, dtype: int64

In [17]:
# assign data frame column slice to a variable
emp_no = df['emp_no']

In [18]:
emp_no

0    100
1    101
2    102
Name: emp_no, dtype: int64

In [19]:
# check datatype of data frame
type(emp_no)

pandas.core.series.Series

In [20]:
# check data type 
# O means string in pandas when you ask for data type
df.emp_no.dtype

dtype('int64')

In [26]:
# Using Dictionary 
dic = {'emp_no':[100,101,102], 'emp_name':['Ryan', 'Mike', 'Johnny'], 'emp_sal':[1000.5, 2000.5, 30000.6]}

In [28]:
dic

{'emp_no': [100, 101, 102],
 'emp_name': ['Ryan', 'Mike', 'Johnny'],
 'emp_sal': [1000.5, 2000.5, 30000.6]}

In [29]:
df = pd.DataFrame(dic)

In [30]:
df

   emp_no emp_name  emp_sal
0     100     Ryan   1000.5
1     101     Mike   2000.5
2     102   Johnny  30000.6

In [31]:
# Creating data frames from a file
# ====> From clip board first

In [38]:
df = pd.read_clipboard()

In [39]:
df

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1            5.1          3.5           1.4          0.2  setosa
2            4.9          3.0           1.4          0.2  setosa
3            4.7          3.2           1.3          0.2  setosa
4            4.6          3.1           1.5          0.2  setosa
5            5.0          3.6           1.4          0.2  setosa
6            5.4          3.9           1.7          0.4  setosa
7            4.6          3.4           1.4          0.3  setosa
8            5.0          3.4           1.5          0.2  setosa
9            4.4          2.9           1.4          0.2  setosa
10           4.9          3.1           1.5          0.1  setosa
11           5.4          3.7           1.5          0.2  setosa

In [22]:
# Creating data frames from a CSV file
df = pd.read_csv('dataset/iris.csv')

In [42]:
df

,Unnamed: 0,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species
0,1,5.1,3.5,1.4,0.2,setosa
1,2,4.9,3.0,1.4,0.2,setosa
2,3,4.7,3.2,1.3,0.2,setosa
3,4,4.6,3.1,1.5,0.2,setosa
4,5,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,virginica
146,147,6.3,2.5,5.0,1.9,virginica
147,148,6.5,3.0,5.2,2.0,virginica
148,149,6.2,3.4,5.4,2.3,virginica
149,150,5.9,3.0,5.1,1.8,virginica

In [46]:
pip install lxml

Collecting lxml
  Downloading lxml-4.9.0-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (6.9 MB)
     |████████████████████████████████| 6.9 MB 5.1 MB/s eta 0:00:01
Installing collected packages: lxml
Successfully installed lxml-4.9.0
Note: you may need to restart the kernel to use updated packages.

In [16]:
df = pd.read_html('dataset/index.html')

In [17]:
df

[   Rank                Name Total LBS Lost Total % Lost
 0     1        Mike Botelho           29.8       11.71%
 1     2      Paul Hutchison           24.5        9.88%
 2     3       Greg Wallerus           14.4        7.00%
 3     4     Frank Venturini           12.0        5.79%
 4     5  Christian Granados           10.3        4.70%
 5     6          Hugo Silva            3.4        1.74%
 6     7       Rob Simonetti            2.0        0.97%
 7     8       Ryan O'Connor          (3.0)      (1.54)%]

In [20]:
df[0]

   Rank                Name Total LBS Lost Total % Lost
0     1        Mike Botelho           29.8       11.71%
1     2      Paul Hutchison           24.5        9.88%
2     3       Greg Wallerus           14.4        7.00%
3     4     Frank Venturini           12.0        5.79%
4     5  Christian Granados           10.3        4.70%
5     6          Hugo Silva            3.4        1.74%
6     7       Rob Simonetti            2.0        0.97%
7     8       Ryan O'Connor          (3.0)      (1.54)%

In [34]:
df

,Unnamed: 0,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species
0,1,5.1,3.5,1.4,0.2,setosa
1,2,4.9,3.0,1.4,0.2,setosa
2,3,4.7,3.2,1.3,0.2,setosa
3,4,4.6,3.1,1.5,0.2,setosa
4,5,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,virginica
146,147,6.3,2.5,5.0,1.9,virginica
147,148,6.5,3.0,5.2,2.0,virginica
148,149,6.2,3.4,5.4,2.3,virginica
149,150,5.9,3.0,5.1,1.8,virginica

In [35]:
df.tail()

,Unnamed: 0,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species
145,146,6.7,3.0,5.2,2.3,virginica
146,147,6.3,2.5,5.0,1.9,virginica
147,148,6.5,3.0,5.2,2.0,virginica
148,149,6.2,3.4,5.4,2.3,virginica
149,150,5.9,3.0,5.1,1.8,virginica

In [36]:
df.head()

   Unnamed: 0  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           1           5.1          3.5           1.4          0.2  setosa
1           2           4.9          3.0           1.4          0.2  setosa
2           3           4.7          3.2           1.3          0.2  setosa
3           4           4.6          3.1           1.5          0.2  setosa
4           5           5.0          3.6           1.4          0.2  setosa

In [37]:
df.shape

(150, 6)

In [39]:
df.size

900

In [40]:
df.dtypes

Unnamed: 0        int64
Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [41]:
df.ndim

2

In [42]:
df.values

array([[1, 5.1, 3.5, 1.4, 0.2, 'setosa'],
       [2, 4.9, 3.0, 1.4, 0.2, 'setosa'],
       [3, 4.7, 3.2, 1.3, 0.2, 'setosa'],
       [4, 4.6, 3.1, 1.5, 0.2, 'setosa'],
       [5, 5.0, 3.6, 1.4, 0.2, 'setosa'],
       [6, 5.4, 3.9, 1.7, 0.4, 'setosa'],
       [7, 4.6, 3.4, 1.4, 0.3, 'setosa'],
       [8, 5.0, 3.4, 1.5, 0.2, 'setosa'],
       [9, 4.4, 2.9, 1.4, 0.2, 'setosa'],
       [10, 4.9, 3.1, 1.5, 0.1, 'setosa'],
       [11, 5.4, 3.7, 1.5, 0.2, 'setosa'],
       [12, 4.8, 3.4, 1.6, 0.2, 'setosa'],
       [13, 4.8, 3.0, 1.4, 0.1, 'setosa'],
       [14, 4.3, 3.0, 1.1, 0.1, 'setosa'],
       [15, 5.8, 4.0, 1.2, 0.2, 'setosa'],
       [16, 5.7, 4.4, 1.5, 0.4, 'setosa'],
       [17, 5.4, 3.9, 1.3, 0.4, 'setosa'],
       [18, 5.1, 3.5, 1.4, 0.3, 'setosa'],
       [19, 5.7, 3.8, 1.7, 0.3, 'setosa'],
       [20, 5.1, 3.8, 1.5, 0.3, 'setosa'],
       [21, 5.4, 3.4, 1.7, 0.2, 'setosa'],
       [22, 5.1, 3.7, 1.5, 0.4, 'setosa'],
       [23, 4.6, 3.6, 1.0, 0.2, 'setosa'],
       [24, 5.1, 3.3, 1.7, 0.5, 'setosa'],
       [25, 4.8, 3.4, 1.9, 0.2, 'setosa'],
       [26, 5.0, 3.0, 1.6, 0.2, 'setosa'],
       [27, 5.0, 3.4, 1.6, 0.4, 'setosa'],
       [28, 5.2, 3.5, 1.5, 0.2, 'setosa'],
       [29, 5.2, 3.4, 1.4, 0.2, 'setosa'],
       [30, 4.7, 3.2, 1.6, 0.2, 'setosa'],
       [31, 4.8, 3.1, 1.6, 0.2, 'setosa'],
       [32, 5.4, 3.4, 1.5, 0.4, 'setosa'],
       [33, 5.2, 4.1, 1.5, 0.1, 'setosa'],
       [34, 5.5, 4.2, 1.4, 0.2, 'setosa'],
       [35, 4.9, 3.1, 1.5, 0.2, 'setosa'],
       [36, 5.0, 3.2, 1.2, 0.2, 'setosa'],
       [37, 5.5, 3.5, 1.3, 0.2, 'setosa'],
       [38, 4.9, 3.6, 1.4, 0.1, 'setosa'],
       [39, 4.4, 3.0, 1.3, 0.2, 'setosa'],
       [40, 5.1, 3.4, 1.5, 0.2, 'setosa'],
       [41, 5.0, 3.5, 1.3, 0.3, 'setosa'],
       [42, 4.5, 2.3, 1.3, 0.3, 'setosa'],
       [43, 4.4, 3.2, 1.3, 0.2, 'setosa'],
       [44, 5.0, 3.5, 1.6, 0.6, 'setosa'],
       [45, 5.1, 3.8, 1.9, 0.4, 'setosa'],
       [46, 4.8, 3.0, 1.4, 0.3, 'setosa'],
       [47, 5.1, 3.8, 1.6, 0.2, 'setosa'],
       [48, 4.6, 3.2, 1.4, 0.2, 'setosa'],
       [49, 5.3, 3.7, 1.5, 0.2, 'setosa'],
       [50, 5.0, 3.3, 1.4, 0.2, 'setosa'],
       [51, 7.0, 3.2, 4.7, 1.4, 'versicolor'],
       [52, 6.4, 3.2, 4.5, 1.5, 'versicolor'],
       [53, 6.9, 3.1, 4.9, 1.5, 'versicolor'],
       [54, 5.5, 2.3, 4.0, 1.3, 'versicolor'],
       [55, 6.5, 2.8, 4.6, 1.5, 'versicolor'],
       [56, 5.7, 2.8, 4.5, 1.3, 'versicolor'],
       [57, 6.3, 3.3, 4.7, 1.6, 'versicolor'],
       [58, 4.9, 2.4, 3.3, 1.0, 'versicolor'],
       [59, 6.6, 2.9, 4.6, 1.3, 'versicolor'],
       [60, 5.2, 2.7, 3.9, 1.4, 'versicolor'],
       [61, 5.0, 2.0, 3.5, 1.0, 'versicolor'],
       [62, 5.9, 3.0, 4.2, 1.5, 'versicolor'],
       [63, 6.0, 2.2, 4.0, 1.0, 'versicolor'],
       [64, 6.1, 2.9, 4.7, 1.4, 'versicolor'],
       [65, 5.6, 2.9, 3.6, 1.3, 'versicolor'],
       [66, 6.7, 3.1, 4.4, 1.4, 'versicolor'],
       [67, 5.6, 3.0, 4.5, 1.5, 'versicolor'],
       [68, 5.8, 2.7, 4.1, 1.0, 'versicolor'],
       [69, 6.2, 2.2, 4.5, 1.5, 'versicolor'],
       [70, 5.6, 2.5, 3.9, 1.1, 'versicolor'],
       [71, 5.9, 3.2, 4.8, 1.8, 'versicolor'],
       [72, 6.1, 2.8, 4.0, 1.3, 'versicolor'],
       [73, 6.3, 2.5, 4.9, 1.5, 'versicolor'],
       [74, 6.1, 2.8, 4.7, 1.2, 'versicolor'],
       [75, 6.4, 2.9, 4.3, 1.3, 'versicolor'],
       [76, 6.6, 3.0, 4.4, 1.4, 'versicolor'],
       [77, 6.8, 2.8, 4.8, 1.4, 'versicolor'],
       [78, 6.7, 3.0, 5.0, 1.7, 'versicolor'],
       [79, 6.0, 2.9, 4.5, 1.5, 'versicolor'],
       [80, 5.7, 2.6, 3.5, 1.0, 'versicolor'],
       [81, 5.5, 2.4, 3.8, 1.1, 'versicolor'],
       [82, 5.5, 2.4, 3.7, 1.0, 'versicolor'],
       [83, 5.8, 2.7, 3.9, 1.2, 'versicolor'],
       [84, 6.0, 2.7, 5.1, 1.6, 'versicolor'],
       [85, 5.4, 3.0, 4.5, 1.5, 'versicolor'],
       [86, 6.0, 3.4, 4.5, 1.6, 'versicolor'],
       [87, 6.7, 3.1, 4.7, 1.5, 'versicolor'],
       [88, 6.3, 2.3, 4.4, 1.3, 'versicolor'],
       [89, 5.6, 3.0, 4.1, 1.3, 'versicolor'],
       [90, 5.5, 2.5, 4.0, 1.3, 'versicolor'],
       [91, 5.5, 2.6, 4.4, 1.2, 'versicolor'],
       [92, 6.1, 3.0, 4.6, 1.4, 'versicolor'],
       [93, 5.8, 2.6, 4.0, 1.2, 'versicolor'],
       [94, 5.0, 2.3, 3.3, 1.0, 'versicolor'],
       [95, 5.6, 2.7, 4.2, 1.3, 'versicolor'],
       [96, 5.7, 3.0, 4.2, 1.2, 'versicolor'],
       [97, 5.7, 2.9, 4.2, 1.3, 'versicolor'],
       [98, 6.2, 2.9, 4.3, 1.3, 'versicolor'],
       [99, 5.1, 2.5, 3.0, 1.1, 'versicolor'],
       [100, 5.7, 2.8, 4.1, 1.3, 'versicolor'],
       [101, 6.3, 3.3, 6.0, 2.5, 'virginica'],
       [102, 5.8, 2.7, 5.1, 1.9, 'virginica'],
       [103, 7.1, 3.0, 5.9, 2.1, 'virginica'],
       [104, 6.3, 2.9, 5.6, 1.8, 'virginica'],
       [105, 6.5, 3.0, 5.8, 2.2, 'virginica'],
       [106, 7.6, 3.0, 6.6, 2.1, 'virginica'],
       [107, 4.9, 2.5, 4.5, 1.7, 'virginica'],
       [108, 7.3, 2.9, 6.3, 1.8, 'virginica'],
       [109, 6.7, 2.5, 5.8, 1.8, 'virginica'],
       [110, 7.2, 3.6, 6.1, 2.5, 'virginica'],
       [111, 6.5, 3.2, 5.1, 2.0, 'virginica'],
       [112, 6.4, 2.7, 5.3, 1.9, 'virginica'],
       [113, 6.8, 3.0, 5.5, 2.1, 'virginica'],
       [114, 5.7, 2.5, 5.0, 2.0, 'virginica'],
       [115, 5.8, 2.8, 5.1, 2.4, 'virginica'],
       [116, 6.4, 3.2, 5.3, 2.3, 'virginica'],
       [117, 6.5, 3.0, 5.5, 1.8, 'virginica'],
       [118, 7.7, 3.8, 6.7, 2.2, 'virginica'],
       [119, 7.7, 2.6, 6.9, 2.3, 'virginica'],
       [120, 6.0, 2.2, 5.0, 1.5, 'virginica'],
       [121, 6.9, 3.2, 5.7, 2.3, 'virginica'],
       [122, 5.6, 2.8, 4.9, 2.0, 'virginica'],
       [123, 7.7, 2.8, 6.7, 2.0, 'virginica'],
       [124, 6.3, 2.7, 4.9, 1.8, 'virginica'],
       [125, 6.7, 3.3, 5.7, 2.1, 'virginica'],
       [126, 7.2, 3.2, 6.0, 1.8, 'virginica'],
       [127, 6.2, 2.8, 4.8, 1.8, 'virginica'],
       [128, 6.1, 3.0, 4.9, 1.8, 'virginica'],
       [129, 6.4, 2.8, 5.6, 2.1, 'virginica'],
       [130, 7.2, 3.0, 5.8, 1.6, 'virginica'],
       [131, 7.4, 2.8, 6.1, 1.9, 'virginica'],
       [132, 7.9, 3.8, 6.4, 2.0, 'virginica'],
       [133, 6.4, 2.8, 5.6, 2.2, 'virginica'],
       [134, 6.3, 2.8, 5.1, 1.5, 'virginica'],
       [135, 6.1, 2.6, 5.6, 1.4, 'virginica'],
       [136, 7.7, 3.0, 6.1, 2.3, 'virginica'],
       [137, 6.3, 3.4, 5.6, 2.4, 'virginica'],
       [138, 6.4, 3.1, 5.5, 1.8, 'virginica'],
       [139, 6.0, 3.0, 4.8, 1.8, 'virginica'],
       [140, 6.9, 3.1, 5.4, 2.1, 'virginica'],
       [141, 6.7, 3.1, 5.6, 2.4, 'virginica'],
       [142, 6.9, 3.1, 5.1, 2.3, 'virginica'],
       [143, 5.8, 2.7, 5.1, 1.9, 'virginica'],
       [144, 6.8, 3.2, 5.9, 2.3, 'virginica'],
       [145, 6.7, 3.3, 5.7, 2.5, 'virginica'],
       [146, 6.7, 3.0, 5.2, 2.3, 'virginica'],
       [147, 6.3, 2.5, 5.0, 1.9, 'virginica'],
       [148, 6.5, 3.0, 5.2, 2.0, 'virginica'],
       [149, 6.2, 3.4, 5.4, 2.3, 'virginica'],
       [150, 5.9, 3.0, 5.1, 1.8, 'virginica']], dtype=object)

In [43]:
df.columns

Index(['Unnamed: 0', 'Sepal.Length', 'Sepal.Width', 'Petal.Length',
       'Petal.Width', 'Species'],
      dtype='object')

In [44]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [45]:
df.axes

[RangeIndex(start=0, stop=150, step=1),
 Index(['Unnamed: 0', 'Sepal.Length', 'Sepal.Width', 'Petal.Length',
        'Petal.Width', 'Species'],
       dtype='object')]

In [46]:
df.describe

<bound method NDFrame.describe of      Unnamed: 0  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  \
0             1           5.1          3.5           1.4          0.2
1             2           4.9          3.0           1.4          0.2
2             3           4.7          3.2           1.3          0.2
3             4           4.6          3.1           1.5          0.2
4             5           5.0          3.6           1.4          0.2
..          ...           ...          ...           ...          ...
145         146           6.7          3.0           5.2          2.3
146         147           6.3          2.5           5.0          1.9
147         148           6.5          3.0           5.2          2.0
148         149           6.2          3.4           5.4          2.3
149         150           5.9          3.0           5.1          1.8

       Species
0       setosa
1       setosa
2       setosa
3       setosa
4       setosa
..         ...
145  virginica
146  virginica
147  virginica
148  virginica
149  virginica

[150 rows x 6 columns]>

In [49]:
# Loading in a new data frame file: salaries.csv
df = pd.read_csv('dataset/Salaries.csv')

In [50]:
df.describe

<bound method NDFrame.describe of          rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]>

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [56]:
# df.median(include='O')

In [63]:
df['salary'].median()

104671.0

In [59]:
## ==> DataFrame Slicing
## One or more columns
df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [60]:
df['salary']

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [62]:
df['salary'].mean()

108023.78205128205

In [65]:
df.salary.mean()

108023.78205128205

In [68]:
# If you want to extract multiple specific columns, then you need to pass the list of column names
cols = ['rank', 'phd', 'sex']
df[cols]

# You can also assigned this data to a new data frame
new_df = df[cols]
new_df

         rank  phd     sex
0        Prof   56    Male
1        Prof   12    Male
2        Prof   23    Male
3        Prof   40    Male
4        Prof   20    Male
..        ...  ...     ...
73       Prof   18  Female
74  AssocProf   19  Female
75       Prof   17  Female
76       Prof   28  Female
77       Prof   23  Female

[78 rows x 3 columns]

In [72]:
new_df.head()

   rank  phd   sex
0  Prof   56  Male
1  Prof   12  Male
2  Prof   23  Male
3  Prof   40  Male
4  Prof   20  Male

In [75]:
df.loc[1:10, 'rank':'sex'] #Slicing range of labels,  you can also add .head() to end of this

         rank discipline  phd  service   sex
1        Prof          A   12        6  Male
2        Prof          A   23       20  Male
3        Prof          A   40       31  Male
4        Prof          B   20       18  Male
5        Prof          A   20       20  Male
6   AssocProf          A   20       17  Male
7        Prof          A   18       18  Male
8        Prof          A   29       19  Male
9        Prof          A   51       51  Male
10       Prof          B   39       33  Male

In [76]:
# request specific row labels and specific column labels to slice, not possible in arrays
# numbers are automatically assigned to row labels if none is given when assigned to dataframe
df.loc[[1,5,9],['rank', 'sex', 'salary']]

   rank   sex  salary
1  Prof  Male   93000
5  Prof  Male  122400
9  Prof  Male   57800

In [77]:
# Slicing based on range of index positions
# remember, if you want to get rows 1-10, then you need to add + 1 to the end, 
df.iloc[1:11, 0:-1]

         rank discipline  phd  service   sex
1        Prof          A   12        6  Male
2        Prof          A   23       20  Male
3        Prof          A   40       31  Male
4        Prof          B   20       18  Male
5        Prof          A   20       20  Male
6   AssocProf          A   20       17  Male
7        Prof          A   18       18  Male
8        Prof          A   29       19  Male
9        Prof          A   51       51  Male
10       Prof          B   39       33  Male

In [81]:
# Slicing based on specific column index positions and row index range
# You just need to pass a list of column indexes
df.iloc[1:11, [0, -2, -1]]

         rank   sex  salary
1        Prof  Male   93000
2        Prof  Male  110515
3        Prof  Male  131205
4        Prof  Male  104800
5        Prof  Male  122400
6   AssocProf  Male   81285
7        Prof  Male  126300
8        Prof  Male   94350
9        Prof  Male   57800
10       Prof  Male  128250

In [83]:
# Extraction based on specific row index positions and specific  column index positinos
df.iloc[[0,1,5,9], [0,-2,-1]]

   rank   sex  salary
0  Prof  Male  186960
1  Prof  Male   93000
5  Prof  Male  122400
9  Prof  Male   57800